Also appear to be running into possibly an API rate limit issue when building and managing multiple group policies per apply. When i have 4 policies to build. I can get two to build at first and two will error out on operation CreateNetworkGroupPolicy.

```
Run terraform apply -auto-approve
data.meraki_networks.dev_networks: Reading...
data.meraki_networks.dev_networks: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # meraki_networks_appliance_firewall_firewalled_services.this_icmp will be created
  + resource "meraki_networks_appliance_firewall_firewalled_services" "this_icmp" {
      + access      = "unrestricted"
      + allowed_ips = (known after apply)
      + network_id  = "L_783626335162467749"
      + service     = "ICMP"
    }

  # meraki_networks_appliance_firewall_firewalled_services.this_snmp will be created
  + resource "meraki_networks_appliance_firewall_firewalled_services" "this_snmp" {
      + access      = "blocked"
      + allowed_ips = (known after apply)
      + network_id  = "L_783626335162467749"
      + service     = "SNMP"
    }

  # meraki_networks_appliance_firewall_firewalled_services.this_web will be created
  + resource "meraki_networks_appliance_firewall_firewalled_services" "this_web" {
      + access      = "blocked"
      + allowed_ips = (known after apply)
      + network_id  = "L_783626335162467749"
      + service     = "web"
    }

  # meraki_networks_group_policies.group_policy_byod will be created
  + resource "meraki_networks_group_policies" "group_policy_byod" {
      + bandwidth                    = (known after apply)
      + bonjour_forwarding           = (known after apply)
      + content_filtering            = (known after apply)
      + firewall_and_traffic_shaping = (known after apply)
      + group_policy_id              = (known after apply)
      + name                         = "BYOD"
      + network_id                   = "L_783626335162467749"
      + scheduling                   = (known after apply)
      + splash_auth_settings         = (known after apply)
      + vlan_tagging                 = {
          + settings = "custom"
          + vlan_id  = "20"
        }
    }

  # meraki_networks_group_policies.group_policy_guest will be created
  + resource "meraki_networks_group_policies" "group_policy_guest" {
      + bandwidth                    = (known after apply)
      + bonjour_forwarding           = (known after apply)
      + content_filtering            = (known after apply)
      + firewall_and_traffic_shaping = (known after apply)
      + group_policy_id              = (known after apply)
      + name                         = "GUEST"
      + network_id                   = "L_783626335162467749"
      + scheduling                   = (known after apply)
      + splash_auth_settings         = (known after apply)
      + vlan_tagging                 = {
          + settings = "custom"
          + vlan_id  = "30"
        }
    }

  # meraki_networks_group_policies.group_policy_internal will be created
  + resource "meraki_networks_group_policies" "group_policy_internal" {
      + bandwidth                    = (known after apply)
      + bonjour_forwarding           = (known after apply)
      + content_filtering            = (known after apply)
      + firewall_and_traffic_shaping = (known after apply)
      + group_policy_id              = (known after apply)
      + name                         = "INTERNAL"
      + network_id                   = "L_783626335162467749"
      + scheduling                   = (known after apply)
      + splash_auth_settings         = (known after apply)
      + vlan_tagging                 = {
          + settings = "custom"
          + vlan_id  = "5"
        }
    }

  # meraki_networks_group_policies.group_policy_pan will be created
  + resource "meraki_networks_group_policies" "group_policy_pan" {
      + bandwidth                    = (known after apply)
      + bonjour_forwarding           = (known after apply)
      + content_filtering            = (known after apply)
      + firewall_and_traffic_shaping = (known after apply)
      + group_policy_id              = (known after apply)
      + name                         = "PAN"
      + network_id                   = "L_783626335162467749"
      + scheduling                   = (known after apply)
      + splash_auth_settings         = (known after apply)
      + vlan_tagging                 = {
          + settings = "custom"
          + vlan_id  = "[15](https://github.com/principalinformationservices-emu/infra-meraki-network-test/actions/runs/9213195638/job/25346509549#step:13:16)"
        }
    }

  # meraki_networks_syslog_servers.this_spoke will be created
  + resource "meraki_networks_syslog_servers" "this_spoke" {
      + network_id = "L_783626335[16](https://github.com/principalinformationservices-emu/infra-meraki-network-test/actions/runs/9213195638/job/25346509549#step:13:17)2467749"
      + servers    = [
          + {
              + host  = "162.131.235.[18](https://github.com/principalinformationservices-emu/infra-meraki-network-test/actions/runs/9213195638/job/25346509549#step:13:19)3"
              + port  = 443
              + roles = [
                  + "Air Marshal events",
                  + "Appliance event log",
                  + "Security events",
                  + "Switch event log",
                ]
            },
        ]
    }

Plan: 8 to add, 0 to change, 0 to destroy.
meraki_networks_appliance_firewall_firewalled_services.this_icmp: Creating...
meraki_networks_appliance_firewall_firewalled_services.this_web: Creating...
meraki_networks_appliance_firewall_firewalled_services.this_snmp: Creating...
meraki_networks_group_policies.group_policy_guest: Creating...
meraki_networks_group_policies.group_policy_internal: Creating...
meraki_networks_syslog_servers.this_spoke: Creating...
meraki_networks_group_policies.group_policy_pan: Creating...
meraki_networks_group_policies.group_policy_byod: Creating...
meraki_networks_appliance_firewall_firewalled_services.this_snmp: Creation complete after 1s
meraki_networks_appliance_firewall_firewalled_services.this_web: Creation complete after 1s
meraki_networks_group_policies.group_policy_guest: Creation complete after 1s [name=GUEST]
meraki_networks_appliance_firewall_firewalled_services.this_icmp: Creation complete after 2s
meraki_networks_syslog_servers.this_spoke: Creation complete after 2s
meraki_networks_group_policies.group_policy_byod: Creation complete after 2s [name=BYOD]
╷
│ Error: Failure when executing CreateNetworkGroupPolicy
│ 
│   with meraki_networks_group_policies.group_policy_pan,
│   on network.tf line [48](https://github.com/principalinformationservices-emu/infra-meraki-network-test/actions/runs/9213195638/job/25346509549#step:13:49), in resource "meraki_networks_group_policies" "group_policy_pan":
│   48: resource "meraki_networks_group_policies" "group_policy_pan" {
│ 
│ error with operation CreateNetworkGroupPolicy
╵
╷
│ Error: Failure when executing CreateNetworkGroupPolicy
│ 
│   with meraki_networks_group_policies.group_policy_internal,
│   on network.tf line 57, in resource "meraki_networks_group_policies" "group_policy_internal":
│   [57](https://github.com/principalinformationservices-emu/infra-meraki-network-test/actions/runs/9213195638/job/25346509549#step:13:58): resource "meraki_networks_group_policies" "group_policy_internal" {
│ 
│ error with operation CreateNetworkGroupPolicy
╵
Error: Terraform exited with code 1.
Error: Process completed with exit code 1.
```

If i run another apply I will be able build one or two of the remaining but may error out similar operation failure. This I believe is separate from the issue in the comment prior about the error handling. 